app/controllers/interests_controller.rb

SELECT "interests".* FROM "interests" WHERE "interests"."id" IN (1, 2)
SELECT "interests".* FROM "interests" ORDER BY name
---
  def index

    @interests = Interest.find(@interestsId)

    if params[:persona_id] == nil
      @interests = Interest.order(:name)

SELECT "interests".* FROM "interests" WHERE "interests"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @interest = Interest.find(params[:id])