app/controllers/personas_controller.rb

  def index
    @personas = Persona.order(:name)
---
SELECT "personas".* FROM "personas" ORDER BY name

  def show
    @persona = Persona.find(params[:id])
---
SELECT "personas".* FROM "personas" WHERE "personas"."id" = $1 LIMIT 1  [["id", "1"]]