app/controllers/rols_controller.rb

  def index
    @rols = Rol.find(@rolsId)
---
SELECT "rols".* FROM "rols" WHERE "rols"."id" = $1 LIMIT 1  [["id", 2]]

  def show
    @rol = Rol.find(params[:id])
---
SELECT "rols".* FROM "rols" WHERE "rols"."id" = $1 LIMIT 1  [["id", "1"]]